results/k6-run.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/sprint-3-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  00.9s/30s

running (0m01.9s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  01.9s/30s

running (0m02.9s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  02.9s/30s

running (0m03.9s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  03.9s/30s

running (0m04.9s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  04.9s/30s

running (0m05.9s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  05.9s/30s

running (0m06.9s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  06.9s/30s

running (0m07.9s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  07.9s/30s

running (0m08.9s), 10/10 VUs, 58 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  08.9s/30s

running (0m09.9s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  09.9s/30s

running (0m10.9s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  10.9s/30s

running (0m11.9s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  11.9s/30s

running (0m12.9s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  12.9s/30s

running (0m13.9s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  13.9s/30s

running (0m14.9s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  14.9s/30s

running (0m15.9s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  15.9s/30s

running (0m16.9s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  16.9s/30s

running (0m17.9s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  17.9s/30s

running (0m18.9s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  18.9s/30s

running (0m19.9s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  19.9s/30s

running (0m20.9s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  20.9s/30s

running (0m21.9s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  21.9s/30s

running (0m22.9s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  22.9s/30s

running (0m23.9s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  23.9s/30s

running (0m24.9s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  24.9s/30s

running (0m25.9s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  25.9s/30s

running (0m26.9s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  26.9s/30s

running (0m27.9s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  27.9s/30s

running (0m28.9s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  28.9s/30s

running (0m29.9s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  29.9s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    incident_create_duration
    ✗ 'p(95)<250' p(95)=623.11ms

    incident_create_failed
    ✓ 'rate<0.01' rate=0.00%

    routing_route_duration
    ✓ 'p(95)<400' p(95)=391.24ms

    routing_route_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1200    39.206432/s
    checks_succeeded...: 100.00% 1200 out of 1200
    checks_failed......: 0.00%   0 out of 1200

    ✓ status is 200
    ✓ route returns regionId
    ✓ route returns responseGroup
    ✓ incident status is 201
    ✓ incident returns incidentId
    ✓ incident starts reported

    CUSTOM
    incident_create_duration.......: avg=353.44ms min=254.34ms med=299.9ms  max=951.35ms p(50)=299.9ms  p(95)=623.11ms p(99)=904.13ms
    incident_create_failed.........: 0.00%  0 out of 200
    incident_create_requests.......: 200    6.534405/s
    routing_route_duration.........: avg=150.69ms min=2.19ms   med=126.29ms max=585.85ms p(50)=126.29ms p(95)=391.24ms p(99)=533.15ms
    routing_route_failed...........: 0.00%  0 out of 200
    routing_route_requests.........: 200    6.534405/s

    HTTP
    http_req_duration..............: avg=252.07ms min=2.19ms   med=264.59ms max=951.35ms p(50)=264.59ms p(95)=567.7ms  p(99)=901.38ms
      { expected_response:true }...: avg=252.07ms min=2.19ms   med=264.59ms max=951.35ms p(50)=264.59ms p(95)=567.7ms  p(99)=901.38ms
    http_req_failed................: 0.00%  0 out of 400
    http_reqs......................: 400    13.068811/s

    EXECUTION
    iteration_duration.............: avg=1.52s    min=1.25s    med=1.48s    max=2.5s     p(50)=1.48s    p(95)=1.94s    p(99)=2.47s   
    iterations.....................: 200    6.534405/s
    vus............................: 10     min=10       max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 241 kB 7.9 kB/s
    data_sent......................: 103 kB 3.4 kB/s



running (0m30.6s), 00/10 VUs, 200 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s
time="2026-08-04T03:17:17Z" level=error msg="thresholds on metrics 'incident_create_duration' have been crossed"
