results/k6-run.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/sprint-3-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 28 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 10/10 VUs, 45 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  08.0s/30s

running (0m09.1s), 10/10 VUs, 49 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  09.1s/30s

running (0m10.1s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  10.1s/30s

running (0m11.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 10/10 VUs, 53 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 10/10 VUs, 69 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 10/10 VUs, 73 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  16.1s/30s

running (0m17.1s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  17.1s/30s

running (0m18.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  30s

running (0m31.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s


  █ THRESHOLDS 

    dispatch_create_duration
    ✓ 'p(95)<500' p(95)=486.17ms

    dispatch_create_failed
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    incident_create_duration
    ✗ 'p(95)<250' p(95)=997.3ms

    incident_create_failed
    ✓ 'rate<0.01' rate=0.00%

    routing_route_duration
    ✗ 'p(95)<400' p(95)=792.04ms

    routing_route_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1440    46.073902/s
    checks_succeeded...: 100.00% 1440 out of 1440
    checks_failed......: 0.00%   0 out of 1440

    ✓ status is 200
    ✓ route returns regionId
    ✓ route returns responseGroup
    ✓ incident status is 201
    ✓ incident returns incidentId
    ✓ incident starts reported
    ✓ dispatch status is 201
    ✓ dispatch returns dispatchId
    ✓ dispatch starts assigned to requested team

    CUSTOM
    dispatch_create_duration.......: avg=260.84ms min=198.11ms med=210.4ms  max=1.39s p(50)=210.4ms  p(95)=486.17ms p(99)=1.36s
    dispatch_create_failed.........: 0.00%  0 out of 160
    dispatch_create_requests.......: 160    5.119322/s
    incident_create_duration.......: avg=435.85ms min=254.22ms med=299.94ms max=2.7s  p(50)=299.94ms p(95)=997.3ms  p(99)=2.52s
    incident_create_failed.........: 0.00%  0 out of 160
    incident_create_requests.......: 160    5.119322/s
    routing_route_duration.........: avg=189.05ms min=2.94ms   med=163.56ms max=1.14s p(50)=163.56ms p(95)=792.04ms p(99)=1.08s
    routing_route_failed...........: 0.00%  0 out of 160
    routing_route_requests.........: 160    5.119322/s

    HTTP
    http_req_duration..............: avg=295.25ms min=2.94ms   med=238.35ms max=2.7s  p(50)=238.35ms p(95)=856.67ms p(99)=1.63s
      { expected_response:true }...: avg=295.25ms min=2.94ms   med=238.35ms max=2.7s  p(50)=238.35ms p(95)=856.67ms p(99)=1.63s
    http_req_failed................: 0.00%  0 out of 480
    http_reqs......................: 480    15.357967/s

    EXECUTION
    iteration_duration.............: avg=1.94s    min=1.46s    med=1.69s    max=4.17s p(50)=1.69s    p(95)=3.89s    p(99)=4.05s
    iterations.....................: 160    5.119322/s
    vus............................: 10     min=10       max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 287 kB 9.2 kB/s
    data_sent......................: 118 kB 3.8 kB/s



running (0m31.3s), 00/10 VUs, 160 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s
time="2026-08-04T03:45:24Z" level=error msg="thresholds on metrics 'incident_create_duration, routing_route_duration' have been crossed"
